Revit 2027 API
ParameterTypeId.StructuralAttachmentEndType Property
 "End Attachment Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAttachmentEndType { get; }
Public Shared ReadOnly Property StructuralAttachmentEndType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAttachmentEndType {
	ForgeTypeId^ get ();
}
static member StructuralAttachmentEndType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace